{"directed": true, "multigraph": false, "graph": {}, "nodes": [{"name": "Adrian Pucey", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "", "id": 1}, {"name": "Alicia Spinnet", "schoolyear": "1989", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 2}, {"name": "Angelina Johnson", "schoolyear": "1989", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Unknown", "Skills": "Chaser", "dialogue_text": "", "id": 3}, {"name": "Anthony Goldstein", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Half-blood", "Skills": "Prefect", "dialogue_text": "", "id": 4}, {"name": "Blaise Zabini", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 5}, {"name": "C. Warrington", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "", "id": 6}, {"name": "Cedric Diggory", "schoolyear": "1988", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Skilled Seeker", "dialogue_text": "", "id": 7}, {"name": "Cho Chang", "schoolyear": "1990", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Seeker", "dialogue_text": "", "id": 8}, {"name": "Colin Creevey", "schoolyear": "1992", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Photography", "dialogue_text": "Hi, Harry. I'm Colin Creevey. I'm in Gryffindor too. Wow! Can you turn him around, Harry?", "id": 9}, {"name": "Cormac McLaggen", "schoolyear": "1990", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Quidditch Keeper", "dialogue_text": "", "id": 10}, {"name": "Dean Thomas", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Chaser", "dialogue_text": "Ron, is that your owl?", "id": 11}, {"name": "Demelza Robins", "schoolyear": "1993", "gender": "2", "house": "1", "dialogue_text": "", "id": 12}, {"name": "Dennis Creevey", "schoolyear": "1994", "gender": "1", "house": "1", "Species": "Human ", "Blood status": "Muggle-born", "Skills": NaN, "dialogue_text": "", "id": 13}, {"name": "Draco Malfoy", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Prefect, Seeker", "dialogue_text": "Can I have this?  It's not my fault the teachers have favorites.  That Hermione Granger -- I'll bet you loved that, didn't you, Potter? Famous Harry Potter. Can't go into a bookshop without making the front page. Look, Potter. You've got yourself a girlfriend. See you at school. That's right. And that's not all that's new this year. You see, Weasley, unlike some, my father can afford the best. No one asked your opinion, you filthy little Mudblood. Enemies of the Heir, beware. You'll be next, Mudbloods. All right there, Scarhead? Training for the ballet, Potter!! You'll never catch me, Potter. Scared, Potter? Everte Statum! Serpensortia! Crabbe, Goyle, where have you been? Pigging out in the Great Hall all this time? Why are you wearing glasses? Reading? I didn't know you could read. And what are you doing down here, Weasley? Well, sit down. You'd never know the Weasleys were pure-bloods, the way they behave. They're an embarrassment to the wizarding world. All of them. What's wrong with you, Crabbe? I'm surprised the Daily Prophet hasn't done a report on all these attacks. I suppose Dumbledore is trying to hush it all up. Father always said Dumbledore was the worst thing that ever happened to this place. What? You think there's someone here who's worse than Dumbledore? Well? Do you? Good one, Goyle. You're absolutely right. Saint Potter. And people actually think that he's the Heir of Slytherin? You know I don't, Goyle. I told you yesterday. How many times do I have to tell you? Is this yours? But my father did say this: It's been 50 years since the Chamber was opened. He wouldn't tell me who opened it. Only that they were expelled. The last time the Chamber of Secrets was opened, a Mudblood died. So it's only a matter of time before one of them is killed this time. As for me I hope it's Granger. What's the matter with you two? You're acting very odd. Hey! Where are you going?", "id": 14}, {"name": "Eddie Carmichael", "schoolyear": "1990", "gender": "1", "house": "3", "dialogue_text": "", "id": 15}, {"name": "Eleanor Branstone", "schoolyear": "1994", "gender": "2", "house": "2", "dialogue_text": "", "id": 16}, {"name": "Ernie Macmillan", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Revising, being a Prefect, getting the wrong end of the stick", "dialogue_text": "", "id": 17}, {"name": "Euan Abercrombie", "schoolyear": "1995", "gender": "1", "house": "1", "dialogue_text": "", "id": 18}, {"name": "Fred Weasley", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Come on. Right. Come on. Okay, come on. Shh!  Shh! Ok, come on. Shh! Come on. Morning, Dad. Oh, it... This lot won’t come cheap, Mum.  The spell books alone are very expensive. Not to mention they're dead scared that Harry will Petrify them if they fly anywhere near him.", "id": 19}, {"name": "George Weasley", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Go, go, go, go! Right! Yeah, Mum would never know. Morning, Dad. Oh, it...", "id": 20}, {"name": "Ginny Weasley", "schoolyear": "1992", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Household spells| healing magic", "dialogue_text": "Mum- Mummy, have you seen my jumper? Leave him alone. Harry, It was me. But I swear, I didn't mean to. Riddle made me, and... Harry, you're hurt.", "id": 21}, {"name": "Graham Pritchard", "schoolyear": "1994", "gender": "1", "house": "4", "dialogue_text": "", "id": 22}, {"name": "Gregory Goyle", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Go, go, go, go! Right! Yeah, Mum would never know. Morning, Dad. Oh, it...", "id": 23}, {"name": "Hannah Abbott", "schoolyear": "1991", "gender": "2", "house": "2", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 24}, {"name": "Harry James Potter", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Half-blood", "Skills": "Parseltongue| Defence Against the Dark Arts | Seeker", "dialogue_text": "I can’t let you out, Hedwig.  I’m not allowed to use magic outside of school.  Besides, if Uncle Vernon… Now you’ve done it. But she’s bored!  If I could only let out for an hour or two But I haven’t had any messages from any of my friends... not one… all summer. I’ll be in my bedroom, making no noise and pretending that I don’t exist. Who are you? Not to be to be rude or anything, but this isn’t a great time for me to have a house elf in my bedroom. Why don’t you sit down? Dobby, ssh! I’m sorry!  I didn’t mean to offend you, or anything. You can’t have met many decent wizards then. Stop, Dobby! Dobby, shh! Dobby, please stop! Stop! Stop, Dobby.  Please be quiet!  Are you all right? Your family? What terrible things?  Who’s plotting them? Ok– I- understand. You can’t- say. Dobby! Dobby, put the lamp down. Give me the lamp! Dobby stop! Get in there, and keep quiet! I- I was just— Sorry. Yes, sir... See why I’ve got to go back?  I don’t belong here.  I belong in your world, at Hogwarts.  It’s the only place I’ve got friends! Well, I expect they’ve... been- hang on-  how do you know my friends haven’t been writing to me? Give me those, now! Dobby, get back here! Dobby, please, no! I can’t. Hogwarts is my home! Ron! Fred. George.  What are you all doing here? Ahh- ahh! Let go of me! Get off! I think it’s brilliant Hello. W-what did I do? Raids? Oh, sorry sir. I’m Harry, sir, Harry Potter. Oh, it... Oh, umm... Floo powder? Diagonally. I'm fine, thank you. I was just going...  No. Please... Hagrid! I was lost, I... Hang on. What were you doing down there then? It's great to see you too. I definitely need to remember that one. Thank you. Bye. Voldemort killed my parents. He was nothing more than a murderer. Let's go. Sorry. Lost control of the trolley. Why can't we get through? The train leaves at exactly 11:00. We've missed it. Maybe we should just go and wait by the car. Ron, I should tell you most Muggles aren't accustomed to seeing a flying car. Come on, then. Let's go lower. We need to find the train. All we need to do is catch up with the train. Do you hear that? Hold on. Aaaaaaahhhh! I'm trying. Your hand's all sweaty. I think we found the train. Up! Up! Up! Ron, mind that tree! Aaahhh! Aaah! Be thankful it's not your neck. I don't know. Come on, go! Fast! See you, Hedwig. So a house-elf shows up in my bedroom we can't get through the barrier to platform 93/4... we almost get killed by a tree... Clearly someone doesn't want me here this year. Professor Dumbledore. Professor McGonagall. You're doomed. Hi, Colin. Nice to meet you. Stop. Hold still! Malfoy? No, Colin, get out of the way. Let's take him to Hagrid's. He'll know what to do. Malfoy. He called Hermione... Well, I don't know exactly what it means. What's a Mudblood? That's horrible. Not really. What? That voice. Didn't you hear it? Spooky. Did you hear it? That voice. I heard it first in Lockhart's office. And then again just... It's moving. I think it's going to kill. Strange. I've never seen spiders act like that. Oh, no. It's Filch's cat. It's Mrs. Norris. No. No. It's not true, sir. I swear. I never touched Mrs. Norris. When I said I wasn't hungry. We were heading back to the common room when we found Mrs. Norris. Strange? Do you think I should have told them? Dumbledore and the others, I mean? If there really is a Chamber of Secrets, and it has been opened, that means...  Maybe Ron's right, Hermione. I mean, look at his family. The whole lot of them have been in Slytherin for centuries. How long will it take to make? A month? But, Hermione, if Malfoy is the Heir of Slytherin he could attack half the Muggle-borns in the school by then. Wood, look out! Thank you. No. I think my arm is broken. No, Not you. Dobby? It was you.  You stopped the barrier from letting Ron and me through. You nearly got Ron and me expelled. Your Bludger? You made that Bludger chase after me? You better clear off before my bones come back Dobby, or I might strangle you. I don't suppose you could tell me why you're trying to kill me? Why do you wear that thing, Dobby? Repeat itself? You mean this has happened before? Stop it! Stop it, Dobby! Tell me Dobby when did this happen before? Who's doing it now? No, Dobby. Tell me. Who is it? Thank you, sir. You wish. Rictusempra! I'm a what? I know. I accidentally set a python on my cousin Dudley at the zoo once. Once. But so what? I bet loads of people here can do it. What's bad? If I hadn't told that snake not to attack Justin... You were there. You heard me. I spoke a different language? But I didn't realize... How can I speak a language without knowing I can? But I'm not. I can't be. I'll see you back in the common room. No. Mr. Filch! You don't understand... Professor I swear I didn't. Professor Dumbledore? I...I..I was just wondering if you put me in the right house. You're wrong. Professor. Your bird...There was nothing I could do. He just caught fire. You don't think it was me, professor? No, sir. Nothing Crabbe and Goyle. Ron, maybe I should do it. Wingardium Leviosa. Come on, let's get them. Ron. We still sound like ourselves. You need to sound more like Crabbe. Excellent. Hermione, are you okay? Come on. I think the Slytherin common room's this way. I'm... Ah- um.. Reading. You're wrong! Harry Potter? But then you must have some idea who's behind it all. It's his stomachache. Calm down. Hair! Hermione, come out. We've got loads to tell you. Hermione? Are you okay? She should be out of hospital in a few days when she stops coughing up fur balls. What's this? Looks like Moaning Myrtle's flooded the bathroom. Why would I throw something at you? But who threw it at you, anyway? \"Tom Marvolo Riddle.\" My name is Harry Potter. Do you know anything about the Chamber of Secrets? Can you tell me? Excuse me.  Could you tell me what's going on here? Are you Tom Riddle? Hello, can you hear me? Dumbledore? Hagrid! HAAGRIIID! Wow! It was Hagrid.  Hagrid opened the Chamber of Secrets 50 years ago. The monster had killed somebody, Ron. What would any of us have done? No. What's that you've got, Hagrid? And they found it. Tom Riddle's diary is gone. No. We've got to talk to Hagrid, Ron. I can't believe it's him but if he did set the monster loose last time he'll know how to get inside the Chamber of Secrets. That's a start. I think it's time to get my dad's old cloak out again. What's that for? Hagrid, are you okay? Did you hear about Hermione? Look, we have to ask you something. Do you know who's opened the Chamber of Secrets? Look. Come on. Come on, Fang. Come on. You heard what Hagrid said. Follow the spiders. Shush! Come on. Don't panic. We're friends of Hagrid's. And you? You're Aragog, aren't you? He's in trouble. Up at the school, there have been attacks. They think it's Hagrid. They think he opened the Chamber of Secrets. Like before. Then you're not the monster? But if you're not the monster, then what did kill that girl 50 years ago? But have you seen it? What? Well, thank you. We'll just go. One, but it's not powerful enough for all of them. Let's go! Arania Exumai! Go! Arania Exumai! Don't mention it. Get us out of here. Now! Come on! Come on, move faster! Come on! Go! Get us in the air. Come on! Pull! We know one thing. Hagrid never opened the Chamber of Secrets. He was innocent. Wish you were here, Hermione. We need you. Now more than ever. Ron... This is why Hermione was in the library the day she was attacked. Come on. Of the many fearsome beasts that roam our land none is more deadly than the basilisk.\r Capable of living for hundreds of years instant death awaits any who meet this giant serpent's eye. Spiders flee before it. Ron, this is it. The monster in the Chamber of Secrets is a basilisk. That's why I can hear it speak. It's a snake. Because no one did look it in the eye. Not directly, at least. Colin saw it through his camera. Justin... Justin must have seen the basilisk through Nearly Headless Nick. Nick got the full blast of it. But he's a ghost, he couldn't die again. And Hermione had the mirror. I bet you she was using it to look around corners in case it came along. The water. There was water on the floor that night. She only saw the basilisk's reflection. Spiders flee before it. It all fits. Hermione's answered that too. Remember what Aragog said about that girl 50 years ago? She died in a bathroom? What if she never left? Lockhart may be useless, but he's going to try and get into the Chamber. At least we can tell him what we know. Professor, we have some information for you. Are you going somewhere? You're running away? After all you did in your books? You wrote them. You're a fraud. You've been taking credit for what other wizards have done. Don't even think about it. To ask you how you died. Who was it, Myrtle? Just like that? How? This is it. This is it, Ron. I think this is the entrance to the Chamber of Secrets. Yes, there is. You first. All right. Let's go. Thanks, Myrtle. Now, remember: Any sign of movement, close your eyes straightaway. This way. It's a snake skin. Ron! Ron, are you okay? You wait here and try and shift some of this rock so we can get back through. I'll go on and find Ginny. Ginny! Ginny, please don't be dead. Wake up, wake up. Please wake up. Tom. Tom Riddle. What do you mean, she won't wake? She's not...? Are you a ghost? She's cold as ice. Ginny, please don't be dead. Wake up. You've got to help me, Tom. There's a basilisk. Give me my wand, Tom. We've got to go. We've got to save her. No. She couldn't. She wouldn't. But why? And why did you want to meet me? Hagrid's my friend. And you framed him, didn't you? I'll bet Dumbledore saw right through you. Well, you haven't finished it this time. In a few hours, the Mandrake Draught will be ready. And everyone who was Petrified will be all right again. Why do you care how I escaped? Voldemort was after your time. You. You're the Heir of Slytherin. You're Voldemort. Albus Dumbledore is the greatest sorcerer in the world. He'll never be gone.  Not as long as those who remain are loyal to him. Fawkes? Ginny? Ginny? Don't worry. Ginny, you need to get yourself out. Follow the Chamber and you'll find Ron. You were brilliant, Fawkes. I just wasn't quick enough. Of course. Phoenix tears have healing powers. Thanks. It's all right, Ginny. It's over. It's just a memory. Yes, sir. Yes, sir. It's just... You see, sir, I couldn't help but notice certain things, certain... Certain similarities between Tom Riddle and me. Voldemort transferred some of his powers to me? So the Sorting Hat was right. I should be in Slytherin. Because I asked it to. Godric Gryffindor. Dobby. So this is your master. The family you serve is the Malfoys. Don't worry. I will be. Sir? I wonder if I could have that? Mr. Malfoy. Mr. Malfoy! I have something of yours. I think you do, sir. I think you slipped the diary into Ginny Weasley's cauldron that day at Diagon Alley. Open it. Just promise me something. Never try to save my life again. We had loads of help from you. We couldn't have done it without you. There's no Hogwarts without you, Hagrid.", "id": 25}, {"name": "Hermione Granger", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Almost everything", "dialogue_text": "Harry. Hagrid. It's so good to see you. What did you do to your glasses? Oculus Reparo. Okay, bye. Come on, everyone's been so worried. Fear of a name only increases fear of the thing itself. Mandrake, or Mandragora is used to return those who have been Petrified to their original state. It's also quite dangerous.  The Mandrake's cry is fatal to anyone who hears it. Get off me! Immobulus! At least no one on the Gryffindor team had to buy their way in. They got in on pure talent. You okay, Ron? Say something. He called me a Mudblood. It means \"dirty blood. Mudblood's a foul name for someone who's Muggle-born. Someone with non-magic parents. Someone like me. It's not a term one usually hears in civilized conversation. Harry! Voice? What voice? Harry, wait! Not so fast! The Chamber of Secrets has been opened. \r\nEnemies of the Heir, beware. Enemies of the Heir, beware. It's written in blood. That's why Ron and I went looking for him, professor. We'd just found him when he said... It's a bit strange, isn't it? You hear this voice, a voice only you can hear... and then Mrs. Norris turns up Petrified. It's just strange. No, Harry. Even in the wizarding world, hearing voices isn't a good sign. Professor I was wondering if you could tell us about the Chamber of Secrets. Muggle-borns. Professor? What exactly does legend tell us lies within the Chamber? Yes. Couldn't you tell?  McGonagall's worried.  All the teachers are. The Heir of Slytherin has returned to Hogwarts.  The question is, who is it? If you're talking about Malfoy... I heard him. But Malfoy, the Heir of Slytherin? Even they aren't that thick. But there might be another way. Mind you, it would be difficult. Not to mention we'd be breaking about 50 school rules... and it'll be dangerous. Very dangerous. Here it is. The Polyjuice Potion. Properly brewed, the Polyjuice Potion allows the drinker to transform himself temporarily into the physical form of another. Yes  Exactly. But it's tricky.  I've never seen a more complicated potion. A month. I know. But it's the only plan we've got. No! Even with a proper wand, it's too risky. You could hit Harry. Let's go. Finite Incantatem! Are you okay? You will be able to, won't you? Again? You mean the Chamber of Secrets has been opened before? Maybe. We'll have to wait for the Polyjuice Potion to know for sure. No. No one ever comes in here. Moaning Myrtle. Moaning Myrtle. She's a little sensitive. Do you think he's all right? You can talk to snakes. No, they can't. It's not a very common gift, Harry. This is bad. I don't know, but it sounded like you were egging the snake on or something. Harry, listen to me. There's a reason the symbol of Slytherin house is a serpent. Salazar Slytherin was a Parselmouth. He could talk to snakes too. He lived a thousand years ago. For all we know, you could be. Everything's set.  We just need a bit of who you're changing into. We also need to make sure that the real Crabbe and Goyle can't burst in on us while we're interrogating Malfoy. I've got it all worked out. I filled these with a simple Sleeping Draught. Simple, but powerful. Now, once they're asleep hide them in the broomstick cupboard and pull out a few of their hairs and put on their uniforms. I've already got mine. Millicent Bulstrode. Slytherin. I got this off her robes. I'm going to go check on the Polyjuice Potion. Make sure that Crabbe and Goyle find these. We'll have exactly one hour before we change back into ourselves. Add the hairs. Cheers. Me too. I...I don't think I'm going. You go on without me. Just go. You're wasting time. Go away. Do you remember me telling you that the Polyjuice Potion was only for human transformations? It was cat hair I plucked off Millicent Bulstrode's robes. Look at my face. It can't be Hagrid. It just can't be. Look, Hagrid's our friend.  Why don't we just go and ask him about it? No. It had to be a Gryffindor. Nobody else knows our password. Unless it wasn't a student. Thanks, Sir Nicholas. It's good to be back. Congratulations. I can't believe you solved it. Thanks. Oh, no.", "id": 26}, {"name": "Jimmy Peakes", "schoolyear": "1994", "gender": "1", "house": "1", "dialogue_text": "", "id": 27}, {"name": "Justin Finch-Fletchley", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Muggle-born", "Skills": NaN, "dialogue_text": "What are you playing at?", "id": 28}, {"name": "Katie Bell", "schoolyear": "1990", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 29}, {"name": "Kevin Whitby", "schoolyear": "1994", "gender": "1", "house": "2", "dialogue_text": "", "id": 30}, {"name": "Lavender Brown", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Divination", "dialogue_text": "", "id": 31}, {"name": "Leanne", "schoolyear": "1991", "gender": "2", "house": "2", "dialogue_text": "Ron, is that your owl?", "id": 32}, {"name": "Lee Jordan", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Quidditch commentary | broadcasting", "dialogue_text": "Another goal for Slytherin! They lead Gryffindor 90 to 30. Harry Potter has caught the Snitch. Gryffindor wins!", "id": 33}, {"name": "Lucian Bole", "schoolyear": "1988", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 34}, {"name": "Luna Lovegood", "schoolyear": "1992", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Spotting Nargles", "dialogue_text": "", "id": 35}, {"name": "Malcolm Baddock", "schoolyear": "1994", "gender": "1", "house": "4", "dialogue_text": "", "id": 36}, {"name": "Mandy Brocklehurst", "schoolyear": "1991", "gender": "2", "house": "3", "dialogue_text": "Ladies and gentlemen, Mr. Gilderoy Lockhart.", "id": 37}, {"name": "Marcus Belby", "schoolyear": "1990", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": NaN, "dialogue_text": "", "id": 38}, {"name": "Marcus Flint", "schoolyear": "1986", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser, Captain", "dialogue_text": "Quidditch practice. Easy, Wood. I've got a note. A gift from Draco's father.", "id": 39}, {"name": "Michael Corner", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Half-blood", "Skills": "Potions", "dialogue_text": "", "id": 40}, {"name": "Miles Bletchley", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "What are you playing at?", "id": 41}, {"name": "Millicent Bulstrode", "schoolyear": "1991", "gender": "2", "house": "4", "Species": "Human", "Blood status": "Half-blood", "Skills": NaN, "dialogue_text": "", "id": 42}, {"name": "Natalie McDonald", "schoolyear": "1994", "gender": "2", "house": "1", "dialogue_text": "", "id": 43}, {"name": "Neville Longbottom", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Herbology", "dialogue_text": "Go on, Ron.  I ignored one from my gran once.  It was horrible. Please, get me down! Why is it always me? Harry, I don't know who did it, but you'd better come. Come on! Harry. It's Hermione.", "id": 44}, {"name": "Oliver Wood", "schoolyear": "1987", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or Half-blood", "Skills": "Keeper|  Captain of the Gryffindor Quidditch team", "dialogue_text": "I spent the summer devising a whole new Quidditch program. We're gonna train earlier, harder and longer. What...? I don't believe it. Where you think you're going, Flint? I booked the pitch for Gryffindor today. I, Professor Severus Snape, do hereby give the Slytherin team permission to practice today, owing to the need to train their new Seeker. You've got a new Seeker. Who? Watch yourself, Harry! All right, listen up. We play our game, Hufflepuff doesn't stand a chance. We're stronger, quicker and smarter. Well, that too. Professor McGonagall. We can't cancel Quidditch.", "id": 45}, {"name": "Orla Quirke", "schoolyear": "1994", "gender": "2", "house": "3", "dialogue_text": "", "id": 46}, {"name": "Owen Cauldwell", "schoolyear": "1994", "gender": "1", "house": "2", "dialogue_text": "", "id": 47}, {"name": "Padma Patil", "schoolyear": "1991", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Prefect", "dialogue_text": "", "id": 48}, {"name": "Pansy Parkinson", "schoolyear": "1991", "gender": "2", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Prefect", "dialogue_text": "", "id": 49}, {"name": "Parvati Patil", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Divination", "dialogue_text": "", "id": 50}, {"name": "Penelope Clearwater", "schoolyear": "1987", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Muggle-born or half-blood[", "Skills": "Prefect", "dialogue_text": "There's Nearly Headless Nick.", "id": 51}, {"name": "Percy Weasley", "schoolyear": "1987", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Intelligent| hard-working| a model student", "dialogue_text": "Errol... Oh look, it’s our Hogwarts letters.  And they’ve sent us Harry’s as well. Hello, Sir Nicolas. Excuse me. I happen to be a school prefect. You, on the other hand, have no business wandering the corridors at night. What are your names again? Mind your attitude, Malfoy.", "id": 52}, {"name": "Peregrine Derrick", "schoolyear": "1988", "gender": "1", "house": "4", "dialogue_text": "", "id": 53}, {"name": "Roger Davies", "schoolyear": "1989", "gender": "1", "house": "3", "Species": "Human", "Blood status": NaN, "Skills": "Quidditch Captain, Chaser", "dialogue_text": "", "id": 54}, {"name": "Romilda Vane", "schoolyear": "1993", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Spiking Chocolate Cauldrons with love potion", "dialogue_text": "", "id": 55}, {"name": "Ronald Weasley", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Wizard chess | Quidditch goalkeeping", "dialogue_text": "Hi, Harry! Rescuing you, of course.  Now, come on. Get your trunk!... You’d better stand back. Let’s go! Come on. Come on, Harry! Hurry up! I’ve got you Harry! Drive! By the way, Harry, Happy Birthday! Do you think it’d be all right if we had some of this? It’s not much, but it’s home. They were starving him, Mum.  There were bars on his window! Ginny. She’s been talking about you all summer.  A bit annoying really. Morning, Dad. Dad works in the Ministry of Magic, in the Misuse of Muggle Artifacts Office.  Dad loves Muggles, thinks they’re fascinating. Oh, it... He’s always doing that. But Harry's never traveled by Floo powder before, Mum. Diagon Alley. Mum fancies him. I don't know. The gateway has sealed itself for some reason. Harry, if we can't get through maybe Mum and Dad can't get back. The car. Aaa, Right. Oh, no! The Invisibility Booster must be faulty. Okay. We can't be far behind. We must be getting close. Aaaaaaahhhh! Haaaarryyy! Hold oonnn!!! Take my hand! Hold on! Yeah. Welcome home. It's not working! Aaahhh! Aaah! Stop! Stop! Stop! My wand. Look at my wand. What's happening? Scabbers, you're okay. The caaaar! Dad's gonna kill me. Honestly, Professor Snape, I think it did more damage to us. We'll go and get our stuff, then. You're going to expel us, aren't you? Say it. I'm doomed. Bloody bird's a menace. What do we do now? I smell trouble. Those are Nimbus 2001 s. How did you get those? You'll pay for that one, Malfoy. Eat slugs! It's disgusting. Hear what? Kill? I don't like spiders. What's that? Are you mad? Vera Verto! Three guesses who. Do you think it's true?  Do you think there really is a Chamber of Secrets? Let's think.  Who do we know who thinks all Muggle-borns are scum? Of course. You heard him. You'll be next, Mudbloods. Crabbe and Goyle must know. Maybe we could trick them into telling. You mean if Harry and I drink that stuff, we'll turn into Crabbe and Goyle? Wicked! Malfoy will tell us anything. I'll stop it. Of course. Don't you see? Lucius Malfoy must have opened it when he was at school here. Now he's taught Draco how to do it. Enlighten me. Why are we brewing this potion in broad daylight in the middle of the girls' lavatory? Don't you think we'll get caught? Why? Who? Who's Moaning Myrtle? Who cares? You're a Parselmouth? Why didn't you tell us? That's what you said to it. I heard you speaking Parseltongue. Snake language. Exactly. Now the whole school's gonna think you're his great-great-great grandson. How? Whose hair are you ripping out, then? Yeah. Right. How thick could you get? Essence of Crabbe. I think I'm gonna be sick. Harry? Bloody hell! Bloody hell. But where's Hermione? What are you doing d...? I mean, what are you doing down here? Stomachache. Scar! That was close. Look at your tail. Have you spoken to Hermione? Yuck! But it can't hurt if someone throws something at you. I mean, it'll just go right through you. We don't even know this Tom Riddle. He sounds like a dirty, rotten snitch. That would be a cheerful visit. Hello, Hagrid.\r Tell us, have you been setting anything mad and hairy loose in the castle lately? No. Whoever it was, they must have been looking for something. Hermione! But you heard McGonagall. We're not allowed to leave the tower except for class. That's Dad's boss. Cornelius Fudge, Minister of Magic. Hagrid's right. With Dumbledore gone, there'll be an attack a day. What? They're heading to the Dark Forest. Why spiders? Why couldn't it be \"follow the butterflies\"? Harry, I don't like this. Harry, I don't like this at all. Can we go back now? Harry. Harry! Can we panic now? Know any spells? Where's Hermione when you need her? Glad we're out of there. Thanks for that. The flying gear's jammed! I'm trying! Follow the spiders! Follow the spiders. If Hagrid ever gets out of Azkaban, I'll kill him. I mean, what was the point of sending us in there? What have we found out? What's that? But if it kills by looking people in the eye, why is it no one's dead? And Mrs. Norris? I'm pretty sure she didn't havea camera or a mirror, Harry. How's a basilisk been getting around? A dirty, great snake. Someone would have seen it. Pipes? It's using the plumbing. Moaning Myrtle. Her skeleton will lie in the Chamber forever. Ginny. What about my sister? You're the Defense Against the Dark Arts teacher.  You can't go now. Is there anything you can do? Say something.  Harry say something in Parseltongue! Better you than us. Go on. What's this? Bloody hell. Whatever shed this must be 60 feet long. Or more. Heart of a lion, this one. Harry! Harry I'm fine. Ron Weasley. Lockhart's Memory Charm backfired. He hasn't got a clue who he is. No. What do I do now? Okay. Yes, sir. Yes, sir. Thanks, sir. Welcome back, Hermione.", "id": 56}, {"name": "Rose Zeller", "schoolyear": "1995", "gender": "2", "house": "2", "dialogue_text": "", "id": 57}, {"name": "Seamus Finnigan", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Half-blood", "Skills": "Pyrotechnics", "dialogue_text": "No, ma'am, he's just fainted. Heads up, everyone.  Weasley's gotten himself a Howler. Cornish pixies?", "id": 58}, {"name": "Stewart Ackerley", "schoolyear": "1994", "gender": "1", "house": "3", "dialogue_text": "", "id": 59}, {"name": "Susan Bones", "schoolyear": "1991", "gender": "2", "house": "2", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 60}, {"name": "Terry Boot", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Potions, also knowledgable about Charms", "dialogue_text": "", "id": 61}, {"name": "Theodore Nott", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": NaN, "dialogue_text": "", "id": 62}, {"name": "Vincent Crabbe", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Cool. Umm..um.", "id": 63}, {"name": "Zacharias Smith", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 64}], "links": [{"weight": 1.0, "source": 2, "target": 3}, {"weight": 1.0, "source": 2, "target": 19}, {"weight": 1.0, "source": 2, "target": 20}, {"weight": 1.0, "source": 2, "target": 25}, {"weight": 1.0, "source": 2, "target": 26}, {"weight": 1.0, "source": 2, "target": 29}, {"weight": 1.0, "source": 2, "target": 45}, {"weight": 1.0, "source": 2, "target": 56}, {"weight": 1.0, "source": 3, "target": 2}, {"weight": 1.0, "source": 3, "target": 19}, {"weight": 1.0, "source": 3, "target": 20}, {"weight": 1.0, "source": 3, "target": 25}, {"weight": 1.0, "source": 3, "target": 29}, {"weight": 1.0, "source": 3, "target": 45}, {"weight": 1.0, "source": 11, "target": 25}, {"weight": 1.0, "source": 11, "target": 44}, {"weight": 1.0, "source": 11, "target": 56}, {"weight": 1.0, "source": 11, "target": 58}, {"weight": 1.0, "source": 14, "target": 39}, {"weight": 1.0, "source": 17, "target": 25}, {"weight": 1.0, "source": 19, "target": 2}, {"weight": 1.0, "source": 19, "target": 3}, {"weight": 1.0, "source": 19, "target": 20}, {"weight": 1.0, "source": 19, "target": 25}, {"weight": 1.0, "source": 19, "target": 26}, {"weight": 1.0, "source": 19, "target": 29}, {"weight": 1.0, "source": 19, "target": 33}, {"weight": 1.0, "source": 19, "target": 45}, {"weight": 1.0, "source": 19, "target": 56}, {"weight": 1.0, "source": 20, "target": 2}, {"weight": 1.0, "source": 20, "target": 3}, {"weight": 1.0, "source": 20, "target": 19}, {"weight": 1.0, "source": 20, "target": 25}, {"weight": 1.0, "source": 20, "target": 26}, {"weight": 1.0, "source": 20, "target": 29}, {"weight": 1.0, "source": 20, "target": 33}, {"weight": 1.0, "source": 20, "target": 45}, {"weight": 1.0, "source": 20, "target": 56}, {"weight": 1.0, "source": 21, "target": 25}, {"weight": 1.0, "source": 24, "target": 25}, {"weight": 1.0, "source": 25, "target": 11}, {"weight": 1.0, "source": 25, "target": 17}, {"weight": 1.0, "source": 25, "target": 21}, {"weight": 1.0, "source": 25, "target": 26}, {"weight": 1.0, "source": 25, "target": 28}, {"weight": 1.0, "source": 25, "target": 33}, {"weight": 1.0, "source": 25, "target": 56}, {"weight": 1.0, "source": 26, "target": 2}, {"weight": 1.0, "source": 26, "target": 3}, {"weight": 1.0, "source": 26, "target": 19}, {"weight": 1.0, "source": 26, "target": 20}, {"weight": 1.0, "source": 26, "target": 25}, {"weight": 1.0, "source": 26, "target": 29}, {"weight": 1.0, "source": 26, "target": 45}, {"weight": 1.0, "source": 26, "target": 56}, {"weight": 1.0, "source": 28, "target": 25}, {"weight": 1.0, "source": 29, "target": 2}, {"weight": 1.0, "source": 29, "target": 3}, {"weight": 1.0, "source": 29, "target": 19}, {"weight": 1.0, "source": 29, "target": 20}, {"weight": 1.0, "source": 29, "target": 25}, {"weight": 1.0, "source": 29, "target": 45}, {"weight": 1.0, "source": 33, "target": 19}, {"weight": 1.0, "source": 33, "target": 20}, {"weight": 1.0, "source": 33, "target": 25}, {"weight": 1.0, "source": 33, "target": 56}, {"weight": 1.0, "source": 39, "target": 14}, {"weight": 1.0, "source": 44, "target": 11}, {"weight": 1.0, "source": 44, "target": 25}, {"weight": 1.0, "source": 44, "target": 56}, {"weight": 1.0, "source": 44, "target": 58}, {"weight": 1.0, "source": 45, "target": 2}, {"weight": 1.0, "source": 45, "target": 3}, {"weight": 1.0, "source": 45, "target": 19}, {"weight": 1.0, "source": 45, "target": 20}, {"weight": 1.0, "source": 45, "target": 25}, {"weight": 1.0, "source": 45, "target": 29}, {"weight": 1.0, "source": 52, "target": 21}, {"weight": 1.0, "source": 52, "target": 25}, {"weight": 1.0, "source": 56, "target": 2}, {"weight": 1.0, "source": 56, "target": 3}, {"weight": 1.0, "source": 56, "target": 11}, {"weight": 1.0, "source": 56, "target": 19}, {"weight": 1.0, "source": 56, "target": 20}, {"weight": 1.0, "source": 56, "target": 21}, {"weight": 1.0, "source": 56, "target": 25}, {"weight": 1.0, "source": 56, "target": 26}, {"weight": 1.0, "source": 58, "target": 11}, {"weight": 1.0, "source": 58, "target": 25}, {"weight": 1.0, "source": 58, "target": 44}, {"weight": 1.0, "source": 58, "target": 56}]}