{"directed": true, "multigraph": false, "graph": {}, "nodes": [{"name": "Adrian Pucey", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "", "id": 1}, {"name": "Alicia Spinnet", "schoolyear": "1989", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 2}, {"name": "Angelina Johnson", "schoolyear": "1989", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Unknown", "Skills": "Chaser", "dialogue_text": "", "id": 3}, {"name": "Anthony Goldstein", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Half-blood", "Skills": "Prefect", "dialogue_text": "", "id": 4}, {"name": "Blaise Zabini", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 5}, {"name": "C. Warrington", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "", "id": 6}, {"name": "Cedric Diggory", "schoolyear": "1988", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Skilled Seeker", "dialogue_text": "", "id": 7}, {"name": "Cho Chang", "schoolyear": "1990", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Seeker", "dialogue_text": "", "id": 8}, {"name": "Colin Creevey", "schoolyear": "1992", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Photography", "dialogue_text": "", "id": 9}, {"name": "Cormac McLaggen", "schoolyear": "1990", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Quidditch Keeper", "dialogue_text": "", "id": 10}, {"name": "Dean Thomas", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Chaser", "dialogue_text": "Oh, God. You call that a monkey? That's a boggart, that is.", "id": 11}, {"name": "Demelza Robins", "schoolyear": "1993", "gender": "2", "house": "1", "dialogue_text": "", "id": 12}, {"name": "Dennis Creevey", "schoolyear": "1994", "gender": "1", "house": "1", "Species": "Human ", "Blood status": "Muggle-born", "Skills": NaN, "dialogue_text": "", "id": 13}, {"name": "Draco Malfoy", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Prefect, Seeker", "dialogue_text": "Potter. Is it true you fainted? I mean, you actually fainted? Exactly how do we do that? Don't be such a wimp, Longbottom. Oh, yeah. Terribly funny. Witty. God, this place has gone to the dogs. Wait until Father hears Dumbledore's got this oaf teaching classes. Dementor! Dementor! Oh, please. You're not dangerous at all, are you, you great ugly brute! It's killed me! You're gonna regret this. You and your bloody chicken! It comes and it goes. Still, I consider myself lucky. Madam Pomfrey said another minute and I could've lost my arm. I can't do homework for weeks. This class is ridiculous. Well, well. Look who's here. You two shopping for your new dream home? Bit grand for you, isn't it, Weasle-Bee? Don't your family sleep in one room? Not very friendly. Boys, I think it's time we teach Weasle-Bee how to respect his superiors. How dare you talk to me! You filthy little mudblood! Who is that? Don't stand there! Do something! Get out of the way! Move! What did I say? Father said I can keep the hippogriff's head. I'll donate it to the Gryffindors' room. This is going to be rich. Come to see the show? Not a word to anyone, understood? Come to see the show? Not a word to anyone, understood? I'm gonna get that jumped-up mudblood! Mark my words.", "id": 14}, {"name": "Eddie Carmichael", "schoolyear": "1990", "gender": "1", "house": "3", "dialogue_text": "", "id": 15}, {"name": "Eleanor Branstone", "schoolyear": "1994", "gender": "2", "house": "2", "dialogue_text": "", "id": 16}, {"name": "Ernie Macmillan", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Revising, being a Prefect, getting the wrong end of the stick", "dialogue_text": "", "id": 17}, {"name": "Euan Abercrombie", "schoolyear": "1995", "gender": "1", "house": "1", "dialogue_text": "", "id": 18}, {"name": "Fred Weasley", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Not unless you count Tom. Night maid. The bloke who fixed the toilet. Peaky? What do you expect? He fell over 100 feet. Clever, Harry. We've got a better way. We know. We'll get you there. If you pipe down. Bless him. Now, Harry. It's the secret to our success. But we've decided your needs are greater than ours. George, if you will. Dumbledore. Pacing. Everyone. What they're doing. Every day. From Filch's office. First year. The One-Eyed Witch passageway. Hurry. Filch is heading this way. Mischief managed. Otherwise, anyone can read it. Did not. It's the fastest broom in the world.", "id": 19}, {"name": "George Weasley", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Not flashing that clipping again? No, not a soul. The day maid. Cook. Let's walk you off a tower and see what you look like. You gave us a right good scare. But not clever enough. We know. We'll show you a quicker way. Come and join the big boys. What's this rubbish? he says. It's a wrench giving it to you... I solemnly swear that I am up to no good. We owe them so much. In his study. Does that a lot. Where they are. Every minute. There are seven secret passageways out of the castle. We'd recommend this one. Leads straight you to Honeyduke's. Oh Harry and don't forget. When you're done, just give it a tap and say: Mischief managed. Otherwise, anyone can read it. Did not. It's a Firebolt.", "id": 20}, {"name": "Ginny Weasley", "schoolyear": "1992", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Household spells| healing magic", "dialogue_text": "The Fat Lady! She's gone!", "id": 21}, {"name": "Graham Pritchard", "schoolyear": "1994", "gender": "1", "house": "4", "dialogue_text": "", "id": 22}, {"name": "Gregory Goyle", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "Look who's here. Malfoy, are you okay? Let's go. Quick. Run.", "id": 23}, {"name": "Hannah Abbott", "schoolyear": "1991", "gender": "2", "house": "2", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 24}, {"name": "Harry James Potter", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Half-blood", "Skills": "Parseltongue| Defence Against the Dark Arts | Seeker", "dialogue_text": "Lumos Maxima... Lumos Maxima... Lumos Maxima... Lumos... MAXIMA! Uncle Vernon. I need you to sign this form. Nothing. School stuff I will if she does. Yes. Okay. Oh, yeah. Yeah. I've been beaten loads of times. That's a lie. My dad wasn't a drunk. Shut up! Shut up! No. She deserved what she got. Keep away from me. Yeah? Try me. I don't care. Anywhere is better than here. I fell over. I didn't do it on purpose. Nothing. I didn't. he Leaky Cauldron. That's in London. But the Muggles. Can't they see us? Who is that? That man. How did he escape? Yeah. Him I've heard of. Hedwig. No, thank you. Minister? I don't understand. I broke the law. Underage wizards can't use magic at home. The state of things, sir? Sirius Black, you mean? But what's he got to do with me? Hedwig. Egypt. What's it like? Mrs. Weasley. Good to see you too. Yes. It's all upstairs. Everything. Thank you. Mr. Weasley. Yeah, sure. Yeah. It should be great. Has this anything to do with Sirius Black, sir? Only that he's escaped from Azkaban. Voldemort. Sorry. And kill me. Mr. Weasley why would I go looking for someone who wants to kill me? I didn't mean to blow her up. I just...I lost control. I was lucky not to be arrested actually. Do you think he's really asleep? I gotta tell you something. Yeah. Thanks, Ron. I don't know. Maybe we've broken down. Thank you. What was that thing that came? What happened to me? And did either of you two you know pass out? But someone was screaming. A woman. How did he find out? Fortuna Major. Fortuna Major. Thank you. Still doing that after three years. She can't even sing. Hey, man. Shut up, Malfoy. What? Hey, hey, hey! Brilliant, professor. At least Hagrid didn't get fired. I thought if you signed it, then I could... Forget about it, guys. See you later. Professor, can I ask you something? I did think of Voldemort at first. But then I remembered that night on the train and the dementor. Before I fainted I heard something. A woman screaming. I think it was my mother the night she was murdered. Haunted building in Britain. I know. What's going on? Excuse me, sir. Where's Professor Lupin? It's Quidditch tomorrow. Probably a right sight better than he normally does. Oh, brilliant. What happened? Really? I meant the match. Who won? No. Professor, why do the dementors affect me so? I mean, more than everyone else? I'm scared, professor. I need to know how to fight them. You could teach me. You made the one on the train go away. But you made it go away. Guys, let me go. I'm trying to get to Hogsmeade. Let me go! Come on, guys. Don't... What are you doing?! What's this rubbish? Messrs. Moony, Wormtail, Padfoot and Prongs are proud to present the Marauder's Map. Hang on. This is Hogwarts. And that… No. Is that really...? So you mean this map shows... Everyone? Brilliant! Where did you get it? He was their friend and he betrayed them. He was their friend! I hope he finds me. Because when he does, I'm gonna be ready! When he does, I'm gonna kill him! I'm sure. Yes. Expecto Patronum. Shall we? Wand at the ready. Expecto Patronum! Expecto... Expecto...Expect... That's one nasty dementor. The first time I rode a broom. There's another. It's not happy, exactly. Well, it is. It's the happiest I've ever felt but it's complicated. Just do it. Expecto Patronum! Expecto Patronum! I think I've had enough for today. I was thinking of him. And Mum. Seeing their faces. They were talking to me. Just talking. That's the memory I chose. I don't even know if it's real. But it's the best I have. Ripped to pieces? What are you talking about? Tell those spiders. Sorry. Mischief managed. Nox. I was sleepwalking. My dad didn't strut. And nor do I. If you don't mind, I would appreciate it if you could lower your wand. Spare bit of parchment. Messrs. Moony, Wormtail, Padfoot, and Prongs offer their compliments to Professor Snape and... And request he keep his large nose out of other people's business. No, sir. Yes, sir. Professor, just so you know, I don't think that map always works. Earlier, it showed someone in the castle. Someone I know to be dead. Peter Pettigrew. It's just what I saw. Good night, professor. Hang on. We better take this back. Fine. See you later. Professor Trelawney... Sorry? No. Nothing. Why don't we just set him free? Hagrid! Hagrid. It'll be fine. It'll be okay. What? Oh, no. Ron! Wait! That's not good. Ron, run! Ron! Ron, wait! Ron! Ron. Ron. Come on! Move! Don't worry. I have a hunch. I just hope I'm wrong. Come on. Ron. The dog. Where is it? Then it'll be you! I know why. You betrayed my parents. You're the reason they're dead! Who was it, then? Expelliarmus! Tell me about Peter. No. Pettigrew's dead. You killed him! The map was lying, then. All they could find of Pettigrew was his... Show me. Give it to him, Ron. No! I know what he is. But we'll take him to the castle. Get off! I said we'd take you to the castle. After that, the dementors can have you. Okay. No. Don't worry, okay? It's fine. I'll stay. You okay? I didn't think my dad would have wanted his best friends to become killers. Besides, dead, the truth dies with him. Alive, you're free. I know. What? Come and live with you? Expelliarmus! Come on. Sirius! Sirius! No. Sirius! Expecto Patronum! I saw my dad. He sent the dementors away. I saw him across the lake. They're gonna kill him? It's true sir. Sirius is innocent. What just happened? Where's Ron? I don't know. Going to Hagrid's? Hermione! Hermione! Hermione, wait. Hermione, will you please tell me what it is we're doing? That's us. This is not normal. You mean we've gone back in time? Good punch. Come on. We should be at Hagrid's. Look. Buckbeak's still alive. Here they come. I'd better hurry. That's Pettigrew. Hermione that's the he betrayed my parents. You don't expect me to sit here. Are you mad? That hurt. What? Get away. Get off. Okay, Buckbeak. Come quickly.  Come with us now. Come on. Buckbeak. Okay? Quickly. Hurry up. Okay? Hurry up now, Buckbeak, okay? This way. This way. This way, now. Now what? How? And now we wait. Yeah. Hermione? Before, down by the lake, when I was with Sirius I did see someone. That someone made the dementors go away. It was my dad. It was my dad conjured the Patronus. Dead. I know. I'm just telling you what I saw. You see Sirius talking to me there? He's asking me to come live with him. When we free him, I'll never have to go back to the Dursleys'. It'll just be me and him. We could live in the country someplace you can see the sky. He'll like that after all those years in Azkaban. Let's go. What are you doing? Thanks. Great. Now he's coming for us. Poor Professor Lupin's having a really tough night. Sirius. Come on! Don't worry. My dad will come. He'll conjure the Patronus. Any minute now. Right there. You'll see. Don't worry, he will. He will come. Sirius. Expecto Patronum! You were right, Hermione. It wasn't my dad I saw earlier. It was me! I saw myself conjuring the Patronus before. I knew I could do it this time because well, I had already done it. Does that make sense? I want to go with you. But you're innocent. My mother's eyes. He's free. We did it. I don't know. Honestly, Ron. How can somebody be in two places at once? You've been sacked. Resigned? Why? But Dumbledore... None of it made any difference. Pettigrew escaped. What are you talking about? For me? But who sent it? Lumos. I solemnly swear that I am up to no good. Mischief managed. Nox.", "id": 25}, {"name": "Hermione Granger", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Muggle-born", "Skills": "Almost everything", "dialogue_text": "It's a cat, Ronald. What do you expect? It's in his nature. That's rich coming from the owner of that smelly old shoe brush. Crookshanks, just ignore the mean little boy. Harry. Egyptians used to worship cats. Good morning, Mr. Weasley. Honestly, Ron, it's not funny. Harry was lucky not to be expelled. Come on. Everywhere else is full Professor R.J. Lupin. It's on his suitcase, Ronald. Seems to be. Why? But they'll catch Black, won't they? I mean, everyone's looking for him. Why are we stopping? We can't be there yet. Ouch, Ron. That was my foot. Harry. Harry, are you all right? No one was screaming, Harry. Of course. That's why he knew to give you the chocolate, Harry. Just forget it. That's awful. What a load of rubbish. Me? I've been here all this time. Oh, honestly, Ron. If you ask me, Divination's a woolly discipline. Now, Ancient Runes, that's a fascinating subject. A fair few. Don't be silly. How could anyone be in two classes at once? Broaden your minds. Use your Inner Eye to see the future. I think they're funny. Just ignore him. Tah- tah- tah- dah! Isn't he beautiful? Say hello to Buckbeak. That was wicked, Harry! Hagrid! He has to be taken to the hospital. I hear Draco's father's furious. We haven't heard the end of this. Dufftown? That's not far from here. No one knows. Boggarts are shape-shifters. They take the shape of whatever a person fears the most. That's what makes them so... It's not funny, Ron. Sir, we just learned about red caps and hinkypunks. We're not meant to start that for weeks. Please, sir. An Animagus is a wizard who elects to turn into an animal. A werewolf has no choice. With each full moon he no longer remembers who he is. He'd kill his best friend. Furthermore, The werewolf only responds to the call of its own kind. Go, Harry! Go, Harry! How are you feeling? No one blames you, Harry. Dementors aren't supposed to be on the grounds. Dumbledore's furious. After he saved you, he sent them off. It's meant to be the most haunted building in Britain. Did I mention that? Do you want to move a bit closer? To the Shrieking Shack? Hope you don't mean yourself. Harry! He won't keep it. He'll turn it over to Professor McGonagall. Aren't you? Look who it is. Madam Rosmerta. Ron fancies her. Harry! So rude. Ron, look! Sorry. Sorry. Excuse me, excuse me. Harry, what happened? Beautiful day. Ronald has lost his rat. Rubbish. Well, maybe you should learn to take better care of your pets! Did not. Didn't. How did it go, Hagrid? The hearing? And then? Do you mind me trying? The Grim, possibly. I can't believe they're going to kill Buckbeak. It's just too horrible. You! You foul, loathsome, evil little cockroach! That felt good. We'll stay with you too. I think you owe someone an apology. I meant me! I thought I just saw...Never mind. Ron. Ron! Harry, you do realize what tree this is? Ron!! Ron! Duck! Harry! Oh, I'm sorry. Where do you suppose this goes? We're in the Shrieking Shack, aren't we? Ron. You're okay. If you want to kill Harry, you have to kill us too! No! I trusted you! And all this time, you've been his friend. He's a werewolf! That's why he's been missing classes. Since Professor Snape set the essay. You attacked a teacher! You go, I'll stay. That looks really painful. I'm sure Madam Pomfrey will fix it in a heartbeat. Harry! Harry! Wait. Wait. Professor? Professor Lupin? Harry? What? Listen Harry, they've captured Sirius. Any minute the dementors are gonna perform the Kiss. No. It's worse. Much worse. They're going to suck out his soul. Headmaster, you've got to stop them. They've got the wrong man. The point is, we know the truth. Please believe us. Sorry, Ron, but seeing as you can't walk... 07:30. Where were we at 7:30? Come on. And we can't be seen. You! You foul, loathsome,evil little cockroach! This is a Time-Turner, Harry. McGonagall gave it to me first term. This is how I've been getting to my lessons all year. Yes. Dumbledore obviously wanted us to return to this moment. Clearly, something happened he wants us to change. Thanks. Malfoy's coming. That felt good. Of course. Remember what Dumbledore said? If we succeed, more than one innocent life could be spared. Let's go. Fudge has to see Buckbeak before we steal him. Otherwise, he'll think Hagrid set him free. Harry, you can't. Yes, and you must! Harry, you're in Hagrid's hut now. If you go bursting in, you'll think you've gone mad. Awful things happen to wizards who meddle with time Harry. We can't be seen. Fudge is coming. And we aren't leaving? Why aren't we leaving? Sorry. We're coming out the back door. Go! Is that really what my hair looks like from the back? I thought I just saw… Never mind. Okay, go, Harry. Go! Keep trying. Come on. Quickly. Come on. Come on, Buckbeak. Come and get the nice dead ferret. Come on. It's here. Come on, Beaky. Come on, Buckbeak. Come on. Buckbeak. Come on. We save Sirius. No idea. Look. It's Lupin. And Snape's coming. And now we wait. At least someone's enjoying himself. Yeah? With a Patronus. I heard Snape telling Dumbledore. According to him only a really powerful wizard could have conjured it. Harry, but your dad's... Here we come. That's great. Harry! Saving your life. Yeah, I didn't think about that. Run! That was so scary. This is horrible. Harry, listen to me. No one's coming. You're dying both of you. Harry! No. But I don't like flying...! Bombarda! We have to go. What's he talking about, Harry? This came with it. How fast is it, Harry?", "id": 26}, {"name": "Jimmy Peakes", "schoolyear": "1994", "gender": "1", "house": "1", "dialogue_text": "", "id": 27}, {"name": "Justin Finch-Fletchley", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Muggle-born", "Skills": NaN, "dialogue_text": "", "id": 28}, {"name": "Katie Bell", "schoolyear": "1990", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 29}, {"name": "Kevin Whitby", "schoolyear": "1994", "gender": "1", "house": "2", "dialogue_text": "", "id": 30}, {"name": "Lavender Brown", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Divination", "dialogue_text": "", "id": 31}, {"name": "Leanne", "schoolyear": "1991", "gender": "2", "house": "2", "dialogue_text": "Oh, God. You call that a monkey? That's a boggart, that is.", "id": 32}, {"name": "Lee Jordan", "schoolyear": "1989", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Quidditch commentary | broadcasting", "dialogue_text": "", "id": 33}, {"name": "Lucian Bole", "schoolyear": "1988", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 34}, {"name": "Luna Lovegood", "schoolyear": "1992", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Spotting Nargles", "dialogue_text": "", "id": 35}, {"name": "Malcolm Baddock", "schoolyear": "1994", "gender": "1", "house": "4", "dialogue_text": "", "id": 36}, {"name": "Mandy Brocklehurst", "schoolyear": "1991", "gender": "2", "house": "3", "dialogue_text": "Last call for Hogsmeade! Come on, now!", "id": 37}, {"name": "Marcus Belby", "schoolyear": "1990", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": NaN, "dialogue_text": "", "id": 38}, {"name": "Marcus Flint", "schoolyear": "1986", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser, Captain", "dialogue_text": "", "id": 39}, {"name": "Michael Corner", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Half-blood", "Skills": "Potions", "dialogue_text": "", "id": 40}, {"name": "Miles Bletchley", "schoolyear": "1989", "gender": "1", "house": "4", "dialogue_text": "", "id": 41}, {"name": "Millicent Bulstrode", "schoolyear": "1991", "gender": "2", "house": "4", "Species": "Human", "Blood status": "Half-blood", "Skills": NaN, "dialogue_text": "", "id": 42}, {"name": "Natalie McDonald", "schoolyear": "1994", "gender": "2", "house": "1", "dialogue_text": "", "id": 43}, {"name": "Neville Longbottom", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Herbology", "dialogue_text": "Mr. Potter, at last. Room 11. Right smart bird you got there, Mr. Potter. He arrived here just five minutes before yourself.", "id": 44}, {"name": "Oliver Wood", "schoolyear": "1987", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood or Half-blood", "Skills": "Keeper|  Captain of the Gryffindor Quidditch team", "dialogue_text": "", "id": 45}, {"name": "Orla Quirke", "schoolyear": "1994", "gender": "2", "house": "3", "dialogue_text": "", "id": 46}, {"name": "Owen Cauldwell", "schoolyear": "1994", "gender": "1", "house": "2", "dialogue_text": "", "id": 47}, {"name": "Padma Patil", "schoolyear": "1991", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Prefect", "dialogue_text": "", "id": 48}, {"name": "Pansy Parkinson", "schoolyear": "1991", "gender": "2", "house": "4", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Prefect", "dialogue_text": "Does it hurt terribly, Draco?", "id": 49}, {"name": "Parvati Patil", "schoolyear": "1991", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Divination", "dialogue_text": "Riddikulus!", "id": 50}, {"name": "Penelope Clearwater", "schoolyear": "1987", "gender": "2", "house": "3", "Species": "Human", "Blood status": "Muggle-born or half-blood[", "Skills": "Prefect", "dialogue_text": "", "id": 51}, {"name": "Percy Weasley", "schoolyear": "1987", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Intelligent| hard-working| a model student", "dialogue_text": "Let me through, please. Excuse me! I'm Head Boy! Get back, all of you. No one is to enter this dormitory until it's been searched. Keep calm, everyone. Break into fours. Back to your common room. Be quiet. Make way. The headmaster's here. You heard. Move! Mind where you're going! Slow down! You listen! I'm Head Boy! Come back here!", "id": 52}, {"name": "Peregrine Derrick", "schoolyear": "1988", "gender": "1", "house": "4", "dialogue_text": "", "id": 53}, {"name": "Roger Davies", "schoolyear": "1989", "gender": "1", "house": "3", "Species": "Human", "Blood status": NaN, "Skills": "Quidditch Captain, Chaser", "dialogue_text": "", "id": 54}, {"name": "Romilda Vane", "schoolyear": "1993", "gender": "2", "house": "1", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Spiking Chocolate Cauldrons with love potion", "dialogue_text": "", "id": 55}, {"name": "Ronald Weasley", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Wizard chess | Quidditch goalkeeping", "dialogue_text": "I'm warning you, Hermione. Keep that beast away from Scabbers, or I'll turn it into a tea cozy. A cat? Is that what they told you? Looks like a pig with hair. Harry. Brilliant. Loads of old stuff like mummies, tombs, even Scabbers enjoyed himself. Along with the dung beetle. I haven't shown anyone. Brilliant. I still think it was brilliant. Who do you think that is? Do you know everything? How is it she knows everything? Oh. Let me get this straight. Sirius Black escaped from Azkaban to come after you? Sure. Except no one's ever broken out of Azkaban before and he's a murderous, raving lunatic. What's going on? There's something moving out there. I think someone's coming aboard. Bloody hell! What's happening? Well, you sort of went rigid. We thought maybe you were having a fit or something. No. I felt weird, though. Like I'd never be cheerful again. Shove off, Malfoy. Green. That's a monkey. What is that? Do not give him one again. Hey, Neville, try an elephant. I will. Oh, don't try one of them. Look at him. His face. Where did you come from? Sure. Yeah. Harry's got sort of a wonky cross. That's trials and suffering. And that there could be the sun and that's happiness. So you're gonna suffer, but you're gonna be happy about it. You don't think that Grim thing's got anything to do with Sirius Black? Ancient Runes? Exactly how many classes are you taking? Hang on. That's not possible. Ancient Runes is in the same time as Divination. You have to be in two classes at once. You're supposed to stroke it. Hagrid, exactly what is that? Listen to the idiot. He's really laying it on thick, isn't he? Who? When did she get here? Riddikulus! Honeyduke's Sweetshop is brilliant, but nothing beats Zonko's Joke Shop. We never got to go to the Shrieking Shack. You heard it's the most... Probably Neville forgot the password again. Oh, you're there. Serves her right. She was a terrible singer. Werewolves? When did she come in? Did you see her come in? He's got a point, you know. He looks a bit peaky, doesn't he? Well, you fell off your broom. There's something else you should know too. When you fell, your broom sort of blew into the Whomping Willow, and...Well... Twice. Actually, I'm fine here. Shut your mouth, Malfoy. What's up, Malfoy? Lost your skis? Bloody hell, Harry. That was not funny. Those weasels! Never told me about any Marauder's Map. Sure. Along with his Invisibility Cloak. That's not true! Thick heads. Merry Christmas. Gorgeous. Unless you've been ripped to pieces! I haven't lost anything! Your cat killed him! Harry, you've seen the way that bloodthirsty beast of hers is always lurking about. And Scabbers is gone. Your cat killed him! Did. They're not sacking you! Spiders! There's... There's spiders. Spiders. They want me to tap-dance. I don't wanna tap-dance! Right, yeah. Tell them. I'll tell them... She's gone mental, Hermione has. I mean, not that she wasn't always mental but now it's in the open for everyone to see. I'm not going back. See you. It just got worse. Hermione, no! He's not worth it. Not good, brilliant. Scabbers! You're alive! Right. Next time I see Crookshanks, I'll let him know. Let's go! He bit me. Scabbers. Scabbers, come back. Scabbers, you bit me! Harry, Hermione, run! It's the Grim! Ah! Harry! Harry!Help! It's a trap. He's the dog. He's an Animagus. Harry! What did you just do? Me?! He's mental! Scabbers has been in my family for... So what? What are you trying to do to him? Scabbers! Leave him alone! Get off him! What are you doing? A bit? A bit? You almost tore my leg off! You better go. I'm fine. Go. So painful. They might chop it. It's too late. It's ruined. It'll have to be chopped off. Hermione! Bad idea. Bad idea. Nice doggy. Nice doggy! It's Scabbers who did it. He's my rat, sir. He's not really a rat. He was a rat. He was my brother Percy's rat. But then they gave him an owl... What the bloody hell was that all about? Hermione, no! He's not worth it. Not good, brilliant. Scabbers, you're alive! Let's go. How did you get there? I was talking to you there. And now you're there. Stand back, I said! Or I'll take it upstairs if you don't settle. Quiet. Let the man through. I didn't mean to open it, Harry. It was badly wrapped. They made me do it. No one knows.", "id": 56}, {"name": "Rose Zeller", "schoolyear": "1995", "gender": "2", "house": "2", "dialogue_text": "", "id": 57}, {"name": "Seamus Finnigan", "schoolyear": "1991", "gender": "1", "house": "1", "Species": "Human", "Blood status": "Half-blood", "Skills": "Pyrotechnics", "dialogue_text": "Fortuna Major. Here, listen. She just won't let me in. Exactly. Hey, man. Ron, catch. I think we have a winner. Oh, no. The Grin? What's the Grin? He's been sighted! Sirius Black! Dementors? He slipped past them once. Who's to say he won't do it again? Can I have a go, Harry? After you, of course.", "id": 58}, {"name": "Stewart Ackerley", "schoolyear": "1994", "gender": "1", "house": "3", "dialogue_text": "", "id": 59}, {"name": "Susan Bones", "schoolyear": "1991", "gender": "2", "house": "2", "Species": "Human", "Blood status": "Half-blood", "Skills": "Defensive spells, learned with Dumbledore's Army", "dialogue_text": "", "id": 60}, {"name": "Terry Boot", "schoolyear": "1991", "gender": "1", "house": "3", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Potions, also knowledgable about Charms", "dialogue_text": "", "id": 61}, {"name": "Theodore Nott", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": NaN, "dialogue_text": "", "id": 62}, {"name": "Vincent Crabbe", "schoolyear": "1991", "gender": "1", "house": "4", "Species": "Human", "Blood status": "Pure-blood", "Skills": "Beater", "dialogue_text": "What? Malfoy! Wait! Wait!", "id": 63}, {"name": "Zacharias Smith", "schoolyear": "1991", "gender": "1", "house": "2", "Species": "Human", "Blood status": "Pure-blood or half-blood", "Skills": "Chaser", "dialogue_text": "", "id": 64}], "links": [{"weight": 1.0, "source": 2, "target": 3}, {"weight": 1.0, "source": 2, "target": 19}, {"weight": 1.0, "source": 2, "target": 20}, {"weight": 1.0, "source": 2, "target": 25}, {"weight": 1.0, "source": 2, "target": 26}, {"weight": 1.0, "source": 2, "target": 29}, {"weight": 1.0, "source": 2, "target": 56}, {"weight": 1.0, "source": 3, "target": 2}, {"weight": 1.0, "source": 3, "target": 19}, {"weight": 1.0, "source": 3, "target": 20}, {"weight": 1.0, "source": 3, "target": 25}, {"weight": 1.0, "source": 3, "target": 26}, {"weight": 1.0, "source": 3, "target": 29}, {"weight": 1.0, "source": 3, "target": 56}, {"weight": 1.0, "source": 8, "target": 25}, {"weight": 1.0, "source": 11, "target": 25}, {"weight": 1.0, "source": 11, "target": 31}, {"weight": 1.0, "source": 11, "target": 50}, {"weight": 1.0, "source": 11, "target": 56}, {"weight": 1.0, "source": 11, "target": 58}, {"weight": 1.0, "source": 19, "target": 2}, {"weight": 1.0, "source": 19, "target": 3}, {"weight": 1.0, "source": 19, "target": 20}, {"weight": 1.0, "source": 19, "target": 21}, {"weight": 1.0, "source": 19, "target": 25}, {"weight": 1.0, "source": 19, "target": 26}, {"weight": 1.0, "source": 19, "target": 29}, {"weight": 1.0, "source": 19, "target": 56}, {"weight": 1.0, "source": 20, "target": 2}, {"weight": 1.0, "source": 20, "target": 3}, {"weight": 1.0, "source": 20, "target": 19}, {"weight": 1.0, "source": 20, "target": 21}, {"weight": 1.0, "source": 20, "target": 25}, {"weight": 1.0, "source": 20, "target": 26}, {"weight": 1.0, "source": 20, "target": 29}, {"weight": 1.0, "source": 20, "target": 56}, {"weight": 1.0, "source": 21, "target": 25}, {"weight": 1.0, "source": 21, "target": 26}, {"weight": 1.0, "source": 21, "target": 44}, {"weight": 1.0, "source": 21, "target": 56}, {"weight": 1.0, "source": 25, "target": 11}, {"weight": 1.0, "source": 25, "target": 21}, {"weight": 1.0, "source": 25, "target": 26}, {"weight": 1.0, "source": 25, "target": 44}, {"weight": 1.0, "source": 25, "target": 56}, {"weight": 1.0, "source": 25, "target": 58}, {"weight": 1.0, "source": 26, "target": 2}, {"weight": 1.0, "source": 26, "target": 3}, {"weight": 1.0, "source": 26, "target": 19}, {"weight": 1.0, "source": 26, "target": 20}, {"weight": 1.0, "source": 26, "target": 21}, {"weight": 1.0, "source": 26, "target": 25}, {"weight": 1.0, "source": 26, "target": 44}, {"weight": 1.0, "source": 26, "target": 56}, {"weight": 1.0, "source": 29, "target": 2}, {"weight": 1.0, "source": 29, "target": 3}, {"weight": 1.0, "source": 29, "target": 19}, {"weight": 1.0, "source": 29, "target": 20}, {"weight": 1.0, "source": 29, "target": 25}, {"weight": 1.0, "source": 44, "target": 11}, {"weight": 1.0, "source": 44, "target": 21}, {"weight": 1.0, "source": 44, "target": 25}, {"weight": 1.0, "source": 44, "target": 26}, {"weight": 1.0, "source": 44, "target": 56}, {"weight": 1.0, "source": 44, "target": 58}, {"weight": 1.0, "source": 45, "target": 25}, {"weight": 1.0, "source": 45, "target": 56}, {"weight": 1.0, "source": 50, "target": 11}, {"weight": 1.0, "source": 50, "target": 31}, {"weight": 1.0, "source": 50, "target": 58}, {"weight": 1.0, "source": 52, "target": 25}, {"weight": 1.0, "source": 56, "target": 2}, {"weight": 1.0, "source": 56, "target": 3}, {"weight": 1.0, "source": 56, "target": 19}, {"weight": 1.0, "source": 56, "target": 20}, {"weight": 1.0, "source": 56, "target": 21}, {"weight": 1.0, "source": 56, "target": 25}, {"weight": 1.0, "source": 56, "target": 26}, {"weight": 1.0, "source": 56, "target": 31}, {"weight": 1.0, "source": 56, "target": 44}, {"weight": 1.0, "source": 56, "target": 58}, {"weight": 1.0, "source": 58, "target": 11}, {"weight": 1.0, "source": 58, "target": 25}, {"weight": 1.0, "source": 58, "target": 31}, {"weight": 1.0, "source": 58, "target": 44}, {"weight": 1.0, "source": 58, "target": 50}, {"weight": 1.0, "source": 58, "target": 56}]}